//Напишите программу, которая на вход принимает и выдает его квадат
Console.WriteLine("Введите число: ");
int n = int.Parse( Console.ReadLine() );
Console.WriteLine("Число: " + n);
Console.WriteLine("Квадрат: " + n*n );